import streamlit as st
import json

layer_id=0

# ---- ROUTES DETAILS ----

#路線方向
routes = {
    "1": {
        "方向": {
            "MAF 上環 (港澳碼頭)": {
                "1-正常路線": {
                    "停站": [
                        "跑馬地 (蟠龍道) ($9.00)", "箕鏈坊，藍塘道", "桂芳街，成和道", "山村道，成和道", "景光街",
                        "養和醫院，黃泥涌道", "跑馬地馬場，黃泥涌道", "立德里，摩利臣山道", "利景酒店，灣仔道",
                        "普樂里，灣仔道","修頓球場，軒尼詩道", "晏頓街，軒尼詩道", "太古廣場，金鐘道",
                        "中銀大廈，金鐘道", "置地廣場，德輔道中", "中環街市，德輔道中", "急庇利街，德輔道中",
                        "上環 (港澳碼頭)"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/1-brr-maf_1229516"
                },
                "2-跑馬日，不停馬場": {
                    "停站": [
                        "跑馬地 (蟠龍道) ($9.00)", "箕鏈坊，藍塘道", "桂芳街，成和道", "山村道，成和道", "景光街",
                        "養和醫院，黃泥涌道", "立德里，摩利臣山道", "利景酒店，灣仔道",
                        "普樂里，灣仔道","修頓球場，軒尼詩道", "晏頓街，軒尼詩道", "太古廣場，金鐘道",
                        "中銀大廈，金鐘道", "置地廣場，德輔道中", "中環街市，德輔道中", "急庇利街，德輔道中",
                        "上環 (港澳碼頭)"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/1-brr-maf-race_1229517"
                }
            },
            "BRR 跑馬地 (蟠龍道)": {
                "1-正常路線": {
                    "停站": [
                        "上環 (港澳碼頭) ($9.00)", "無限極廣場，德輔道中", "恒生銀行總行大廈，德輔道中", "德忌利士街，德輔道中", 
                        "皇后像廣場 ，遮打道", "金鐘廊，金鐘道", "軍器廠街，軒尼詩道", "柯布連道，軒尼詩道", 
                        "譚臣道，菲林明道", "克街，灣仔道", "天樂里，灣仔道", "逸廬，黃泥涌道", 
                        "雅谷大廈，黃泥涌道", "跑馬地（下），黃泥涌道", "奕蔭街，成和道", "昇平樓，成和道", 
                        "箕鏈坊", "跑馬地 (蟠龍道)"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/1-maf-brr_1229519"
                },
                "2-假日班次，改經德輔道中": {
                    "停站": [
                        "上環 (港澳碼頭) ($9.00)", "無限極廣場，德輔道中", "恒生銀行總行大廈，德輔道中", "德忌利士街，德輔道中", 
                        "歷山大廈，德輔道中", "遮打花園，德輔道中", "金鐘廊，金鐘道", "軍器廠街，軒尼詩道", "柯布連道，軒尼詩道", 
                        "譚臣道，菲林明道", "克街，灣仔道", "天樂里，灣仔道", "逸廬，黃泥涌道", 
                        "雅谷大廈，黃泥涌道", "跑馬地（下），黃泥涌道", "奕蔭街，成和道", "昇平樓，成和道", 
                        "箕鏈坊", "跑馬地 (蟠龍道)"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/1-maf-brr-holidays_1229520"
                }
            }
}},
    "1M": {
        "方向": {
            "WNG 黃泥涌峽 (循環線)": {
                "1-正常路線": {
                    "停站": [
                        "上環 (港澳碼頭) ($10.60)", "無限極廣場，德輔道中", "恒生銀行總行大廈，德輔道中", "德忌利士街，德輔道中", 
                        "皇后像廣場 ，遮打道", "添馬街", "政府總部，夏愨道", "香港演藝學院，告士打道", "入境事務大樓，告士打道", 
                        "會展站", "譚臣道，菲林明道", "克街，灣仔道", "天樂里，灣仔道", "南洋酒店，摩利臣山道", "逸廬，黃泥涌道", 
                        "雅谷大廈，黃泥涌道", "跑馬地（下），黃泥涌道", "奕蔭街，成和道", "昇平樓，成和道", 
                        "箕鏈坊，藍塘道", "金碧別墅，藍塘道", "千葉居，藍塘道", "大坑道，黃泥涌峽道", "香港網球中心，黃泥涌峽道 (循環點) ($10.60)",
                        "黃泥涌水塘公園，黃泥涌峽道", "大潭水塘道，黃泥涌峽道", "香港網球中心，黃泥涌峽道", "怡園，黃泥涌峽道",
                        "箕璉閣，藍塘道", "安慧苑，藍塘道", "箕鏈坊，藍塘道", "桂芳街，成和道", "山村道，成和道", "景光街",
                        "養和醫院，黃泥涌道", "跑馬地馬場，黃泥涌道", "立德里，摩利臣山道", "利景酒店，灣仔道",
                        "普樂里，灣仔道","會展站", "皇后像廣場，干諾道中", "砵典乍街，干諾道中", "租庇利街，干諾道中",
                        "永和街，干諾道中", "上環 (港澳碼頭)"
                        ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/1m-maf-wng-normal_1229550"
                } ,
                "2-跑馬日，不停馬場": {
                    "停站": [
                        "上環 (港澳碼頭) ($10.60)", "無限極廣場，德輔道中", "恒生銀行總行大廈，德輔道中", "德忌利士街，德輔道中", 
                        "皇后像廣場 ，遮打道", "添馬街", "政府總部，夏愨道", "香港演藝學院，告士打道", "入境事務大樓，告士打道", 
                        "會展站", "譚臣道，菲林明道", "克街，灣仔道", "天樂里，灣仔道", "南洋酒店，摩利臣山道", "逸廬，黃泥涌道", 
                        "雅谷大廈，黃泥涌道", "跑馬地（下），黃泥涌道", "奕蔭街，成和道", "昇平樓，成和道", 
                        "箕鏈坊，藍塘道", "金碧別墅，藍塘道", "千葉居，藍塘道", "大坑道，黃泥涌峽道", "香港網球中心，黃泥涌峽道 (循環點) ($10.60)",
                        "黃泥涌水塘公園，黃泥涌峽道", "大潭水塘道，黃泥涌峽道", "香港網球中心，黃泥涌峽道", "怡園，黃泥涌峽道",
                        "箕璉閣，藍塘道", "安慧苑，藍塘道", "箕鏈坊，藍塘道", "桂芳街，成和道", "山村道，成和道", "景光街",
                        "養和醫院，黃泥涌道", "立德里，摩利臣山道", "利景酒店，灣仔道",
                        "普樂里，灣仔道","會展站", "皇后像廣場，干諾道中", "砵典乍街，干諾道中", "租庇利街，干諾道中",
                        "永和街，干諾道中", "上環 (港澳碼頭)"
                        ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/1m-maf-wng-race_1229554"
                }
            }
}},
"N1": {
        "方向": {
            "MAF 上環 (港澳碼頭)": {
                "1-正常路線": {
                    "停站": [
                        "跑馬地 (蟠龍道) ($18.00)", "箕鏈坊，藍塘道", "桂芳街，成和道", "山村道，成和道", "景光街",
                        "養和醫院，黃泥涌道", "跑馬地馬場，黃泥涌道", "厚德里，黃泥涌道", "禮頓道，摩利臣山道", 
                        "勿地臣街，禮頓街", "雲翠大廈，禮頓道", "邊靈頓街", "希慎廣場，軒尼詩道", "天樂里，軒尼詩道",
                        "北海中心，軒尼詩道", "軒尼詩道官立小學，軒尼詩道", "修頓球場，軒尼詩道", "晏頓街，軒尼詩道", "太古廣場，金鐘道",
                        "中銀大廈，金鐘道", "置地廣場，德輔道中", "中環街市，德輔道中", "急庇利街，德輔道中",
                        "上環 (港澳碼頭)"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/n1-brr-maf_1243452"
                }
            },
            "BRR 跑馬地 (蟠龍道)": {
                "1-正常路線": {
                    "停站": [
                        "上環 (港澳碼頭) ($18.00)", "無限極廣場，德輔道中", "恒生銀行總行大廈，德輔道中", "德忌利士街，德輔道中", 
                        "皇后像廣場 ，遮打道", "金鐘廊，金鐘道", "軍器廠街，軒尼詩道", "柯布連道，軒尼詩道", 
                        "史釗域道，軒尼詩道", "馬師道，軒尼詩道", "崇光百貨，軒尼詩道", "糖街，怡和街", "加路連山道，禮頓道",
                        "逸廬，黃泥涌道", "禮頓中心，禮頓道", "紀利華木球會，黃泥涌道",
                        "雅谷大廈，黃泥涌道", "跑馬地（下），黃泥涌道", "奕蔭街，成和道", "昇平樓，成和道", 
                        "箕鏈坊", "跑馬地 (蟠龍道)"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/n1-maf-brr_1243449"
                }
            }
}},
"2A": {
        "方向": {
            "ADE 金鐘東": {
                "1-正常路線": {
                    "停站": [
                        "嘉亨灣 ($9.90)", "愛秩序灣海濱公園，愛勤道", "愛蝶灣，愛賢街", "峻峰花園，東喜道", "筲箕灣",
                        "海灣華庭，筲箕灣道", "新成街，筲箕灣道", "筲箕灣廣場，耀興道", "東盛苑，耀興道", "耀東邨耀明樓，耀興道",
                        "燿東商場，耀興道", "耀東邨", "耀東邨耀華樓，耀興道", "東熹苑景熹閣，耀興道", "興東邨，耀興道", "太寧街，惠亨街",
                        "康怡廣場，康山道", "寶峰苑，英皇道", "柏架山道，英皇道", "太古坊，英皇道", "民新街，英皇道", "模範邨，英皇道",
                        "健康村，英皇道", "港運城，英皇道", "新都城大廈，英皇道", "長康街，英皇道", "炮台山站，英皇道", "清風街，英皇道",
                        "香港中央圖書館，高士威道", "希慎廣場，軒尼詩道", "北海中心，軒尼詩道", "軒尼詩道官立小學，軒尼詩道", 
                        "香港會議展覽中心 (舊翼)，菲林明道", "中信大廈，龍匯道", "中環軍營，龍和道", "金鐘廊，德立街"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/2a-grp-ade_1243442"
                }
            },
            "GRP 嘉亨灣": {
                "1-正常路線": {
                    "停站": [
                        "金鐘 (東) ($9.90)", "政府總部，夏愨道", "中信大廈，龍匯道", "中環廣場，港灣道", "史釗域道，軒尼詩道",
                        "馬師道，軒尼詩道", "崇光百貨，軒尼詩道", "維多利亞公園，高士威道", "銀幕街，英皇道", "七海商業中心，英皇道",
                        "電廠街，英皇道", "糖水道，英皇道", "琴行街，英皇道", "港運城，英皇道", "健康村，英皇道",
                        "模範邨，英皇道", "北角官立小學，英皇道", "新威園，英皇道", "惠安苑，英皇道", "康怡廣場，康山道",
                        "太康樓，太康街 ($7.00)", "鯉景灣，鯉景道", "西灣河站，太安街", "東欣苑，耀興道", "東熹苑耀興道，耀興道",
                        "東熹苑逸熹閣，耀興道", "耀東邨耀華樓，耀興道", "耀東邨", "耀東邨耀興道，耀興道", "耀東邨耀貴樓",
                        "筲箕灣廣場，耀興道", "南安里，筲箕灣道", "筲箕灣", "愛東邨，愛賢街", "東旭苑，愛勤道", "嘉亨灣"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/2a-ade-grp_1243500"
                }
            }
}}
}



# ------------------- Streamlit UI 設定 -------------------
st.set_page_config(page_title="漢堡巴士路線資料", page_icon="🚌", layout="wide")

st.markdown(
    """
    <style>
    @import url('https://fonts.googleapis.com/css2?family=Roboto:wght@400;500&display=swap');
    @import url('https://fonts.googleapis.com/css2?family=Source+Han+Sans+TC:wght@400;500&display=swap');
    html, body, [class*="css"]  {
        font-family: 'Source Han Sans TC', 'Roboto', sans-serif;

    }
    </style>
    """,
    unsafe_allow_html=True
)

st.title("🚌 漢堡巴士路線")
st.subheader("查閱各路線資料")
st.markdown("[🔗 漢堡巴士 Spreadsheet](https://docs.google.com/spreadsheets/d/1_hF_4ObI7j7OKKa__Bs9-fCLS6jYLvtTxg_nzhzkLjU/edit?gid=956048970)")

# ------------------- 分欄 Layout：左右界面 -------------------
left_col, right_col = st.columns([3, 5])

with left_col:
    input_route = st.text_input("輸入路線", "")
    input_route = input_route.upper().strip()

    if input_route and input_route in routes:
        directions = routes[input_route]["方向"]
        selected_direction = st.selectbox("選擇方向", list(directions.keys()))

        variants = directions[selected_direction]
        selected_variant = st.selectbox("選擇走線", list(variants.keys()))

        variant_data = variants[selected_variant]

    elif input_route:
        st.warning("未有此路線")
        variant_data = None  # 🔐 防止後面繼續執行錯誤
    
    if "variant_data" in locals() and variant_data:
        layer_id = variant_data["地圖"]

        st.markdown("地圖")

        # 建立地圖 iframe URL
        map_url = variant_data["地圖"]

        st.components.v1.html(f"""
            <iframe src="{map_url}"
                width="100%" height="500" frameborder="1"
                allowfullscreen allow="geolocation">
            </iframe>
            """, height=520)

with right_col:

    if "variant_data" in locals() and variant_data and "停站" in variant_data:
        st.markdown("🚏 停站")
        for i, stop in enumerate(variant_data["停站"], start=1):
            st.write(f"{i}. {stop}")