import streamlit as st
import json

layer_id=0

# ------------------- 巴士車站 -------------------

BGB_01839A=["跑馬地 (蟠龍道)"]
BGB_01840A=["箕璉坊，藍塘道"]
BGB_01841A=["桂芳街，成和道"]
BGB_01842A=["山村道，成和道"]
BGB_01843A=["景光街"]
BGB_01844A=["養和醫院，黃泥涌道","跑馬地站"]
BGB_01845A=["跑馬地馬場，黃泥涌道"]
BGB_01846A=["立德里，摩利臣山道"]
BGB_01847A=["利景酒店，灣仔道"]
BGB_01848A=["普樂里，灣仔道"]
BGB_01849A=["修頓球場，軒尼詩道","灣仔站"]
BGB_01850A=["晏頓街，軒尼詩道"]
BGB_01851A=["太古廣場，金鐘道","金鐘站"]
BGB_01852A=["中銀大廈，金鐘道"]
BGB_01853A=["置地廣場，德輔道中","中環站"]
BGB_01854A=["中環街市，德輔道中","中環至半山自動扶梯"]
BGB_01855A=["急庇利街，德輔道中","上環站"]
BGB_01856A=["上環 (港澳碼頭)","西港城、上環站"]
BGB_01857A=["無限極廣場，德輔道中","林士街、上環站"]
BGB_01858A=["恒生銀行總行大廈，德輔道中","中環街市"]
BGB_01859A=["德忌利士街，德輔道中","中環站、香港站"]
BGB_01860A=["皇后像廣場，遮打道","和平紀念碑、大會堂、展城館、中環站"]
BGB_01861A=["歷山大廈，德輔道中"]
BGB_01862A=["遮打花園，德輔道中"]
BGB_01863A=["金鐘廊，金鐘道","太古廣場、金鐘站"]
BGB_01864A=["軍器廠街，軒尼詩道"]
BGB_01865A=["柯布連道，軒尼詩道","灣仔站"]
BGB_01866A=["譚臣道，菲林明道"]
BGB_01867A=["克街，灣仔道"]
BGB_01868A=["天樂里，灣仔道"]
BGB_01869A=["逸廬，黃泥涌道","跑馬地馬場、樂活道"]
BGB_01870A=["雅谷大廈，黃泥涌道"]
BGB_01871A=["跑馬地 (下)"]
BGB_01872A=["奕蔭街，成和道","跑馬地站"]
BGB_01873A=["昇平樓，成和道"]
BGB_01874A=["箕璉坊"]
BGB_01875A=["添馬街","金鐘站"]
BGB_01876A=["政府總部，夏愨道","添馬公園、添馬站"]
BGB_01877A=["香港演藝學院，告士打道"]
BGB_01878A=["入境事務大樓，告士打道","香港會議展覽中心、會展站"]
BGB_01879A=["會展站","灣仔碼頭"]
BGB_01880A=["南洋酒店，摩利臣山道"]
BGB_01881A=["箕璉坊，藍塘道"]
BGB_01882A=["金碧別墅，藍塘道"]
BGB_01883A=["千葉居，藍塘道"]
BGB_01884A=["大坑道，黃泥涌峽道","港安醫院"]
BGB_01885A=["香港網球中心，黃泥涌峽道"]
BGB_01886A=["黃泥涌水塘公園，黃泥涌峽道","黃泥涌峽徑、黃泥涌站"]
BGB_01887A=["大潭水塘道，黃泥涌峽道","黃泥涌水塘公園、黃泥涌站"]
BGB_01888A=["香港網球中心，黃泥涌峽道"]
BGB_01889A=["怡園，黃泥涌峽道","港安醫院"]
BGB_01890A=["箕璉閣，藍塘道"]
BGB_01891A=["安慧苑，藍塘道"]
BGB_01892A=["皇后像廣場，干諾道中","和平紀念碑、大會堂、展城館、中環站"]
BGB_01892B=["皇后像廣場，干諾道中","和平紀念碑、大會堂、展城館"]
BGB_01893A=["砵典乍街，干諾道中","中環站"]
BGB_01894A=["租庇利街，干諾道中"]
BGB_01895A=["永和街，干諾道中"]
BGB_01896A=["厚德里，黃泥涌道"]
BGB_01897A=["禮頓道，摩理臣山道"]
BGB_01898A=["勿地臣街，禮頓道","時代廣場"]
BGB_01899A=["雲翠大廈，禮頓道"]
BGB_01900A=["邊靈頓街"]
BGB_01901A=["希慎廣場，軒尼詩道","崇光百貨、銅鑼灣站"]
BGB_01902A=["天樂里，軒尼詩道"]
BGB_01903A=["北海中心，軒尼詩道"]
BGB_01904A=["軒尼詩道官立小學，軒尼詩道"]
BGB_01905A=["港澳碼頭，干諾道中","西港城、上環站"]
BGB_01906A=["史釗域道，軒尼詩道","駱克道市政大廈"]
BGB_01907A=["馬師道，軒尼詩道","時代廣場"]
BGB_01908A=["崇光百貨，軒尼詩道","銅鑼灣站"]
BGB_01909A=["糖街，怡和街","皇室堡"]
BGB_01910A=["加路連山道，禮頓道"]
BGB_01911A=["禮頓中心，禮頓道"]
BGB_01912A=["紀利華木球會，黃泥涌道","體育道"]
BGB_01913A=["嘉亨灣","鯉景灣"]
BGB_01914A=["愛秩序灣海濱公園，愛勤道"]
BGB_01915A=["愛蝶灣，愛賢街","愛東邨"]
BGB_01916A=["峻峰花園，東喜道"]
BGB_01917A=["筲箕灣"]
BGB_01918A=["海灣華庭，筲箕灣道"]
BGB_01919A=["新成街，筲箕灣道"]
BGB_01920A=["筲箕灣廣場，耀興道"]
BGB_01921A=["東盛苑，耀興道"]
BGB_01922A=["耀東邨耀明樓，耀興道"]
BGB_01923A=["耀東商場，耀興道"]
BGB_01924A=["耀東邨"]
BGB_01925A=["耀東邨耀華樓，耀興道"]
BGB_01926A=["東嘉苑景熹閣，耀興道"]
BGB_01927A=["興東邨，耀興道"]
BGB_01928A=["太寧街，惠亨街"]
BGB_01929A=["康怡廣場，康山道","太古站"]
BGB_01930A=["寶峰園，英皇道","栢蕙苑"]
BGB_01931A=["柏架山道，英皇道"]
BGB_01932A=["太古坊，英皇道","鰂魚涌站"]
BGB_01933A=["民新街，英皇道"]
BGB_01934A=["模範邨，英皇道","K11 ATELIER King's Road"]
BGB_01935A=["健康村，英皇道"]
BGB_01936A=["港運城，英皇道"]
BGB_01937A=["新都城大廈，英皇道"]
BGB_01938A=["長康街，英皇道"]
BGB_01939A=["炮台山站，英皇道","北角城中心、康澤花園"]
BGB_01940A=["清風街，英皇道"]
BGB_01941A=["香港中央圖書館，高士威道","維多利亞公園"]
BGB_01942A=["香港會議展覽中心 (舊翼)，菲林明道","會展站"]
BGB_01943A=["中信大廈，龍匯道","立法會綜合大樓、添馬站"]
BGB_01944A=["中環軍營，龍和道","中環海濱活動空間"]
BGB_01945A=["金鐘廊，德立街","金鐘站"]
BGB_01946A=["金鐘 (東)"]
BGB_01947A=["中信大廈，龍匯道","立法會綜合大樓"]
BGB_01948A=["中環廣場，港灣道","香港會議展覽中心"]
BGB_01949A=["維多利亞公園，高士威道","香港中央圖書館"]
BGB_01950A=["銀幕街，英皇道","天后站"]
BGB_01951A=["七海商業中心，英皇道","炮台山站"]
BGB_01952A=["電廠街，英皇道"]
BGB_01953A=["糖水道，英皇道"]
BGB_01954A=["琴行街，英皇道","北角站"]
BGB_01955A=["港運城，英皇道"]
BGB_01956A=["健康村，英皇道"]
BGB_01957A=["模範邨，英皇道"]
BGB_01958A=["北角官立小學，英皇道","鰂魚涌站"]
BGB_01959A=["新威園，英皇道","太古坊"]
BGB_01960A=["惠安苑，英皇道"]
BGB_01961A=["康怡廣場，康山道","太古站"]
BGB_01962A=["太康樓，太康街"]
BGB_01963A=["鯉景灣，鯉景道","嘉亨灣、鯉景道綜合大樓"]
BGB_01964A=["西灣河站，太安街","西灣河文娛中心"]
BGB_01965A=["東欣苑，耀興道"]
BGB_01966A=["東熹苑耀熹閣，耀興道"]
BGB_01967A=["東熹苑逸熹閣，耀興道"]
BGB_01968A=["耀東邨耀華樓，耀興道"]
BGB_01969A=["耀東邨耀興樓，耀興道"]
BGB_01970A=["耀東邨耀貴樓，耀興道"]
BGB_01971A=["筲箕灣廣場，耀興道"]
BGB_01972A=["南安里，筲箕灣道"]
BGB_01973A=["愛東邨，愛賢街","愛蝶灣"]
BGB_01974A=["東旭苑，愛勤道"]
BGB_01975A=["海晏街，筲箕灣道"]
BGB_01976A=["西灣河文娛中心，筲箕灣道","西灣河站"]
BGB_01977A=["永興街"]
BGB_01978A=["維多利亞公園游泳池，興發街"]
BGB_01979A=["海晏街，筲箕灣道"]
BGB_01980A=["愛秩序灣道，筲箕灣道"]
BGB_01981A=["南康街，筲箕灣道"]
BGB_01982A=["深灣"]
BGB_01983A=["黃竹坑 (南朗山)"]
BGB_01984A=["南朗山道熟食市場，南朗山道","黃竹坑站、港島南岸"]
BGB_01985A=["南朗山道，黃竹坑道","黃竹坑商貿區"]
BGB_01986A=["勝利工廠大廈，黃竹坑道"]
BGB_01987A=["逸港居，香港仔海傍道","香港仔網球及壁球中心"]
BGB_01988A=["香港仔海濱公園，香港仔海傍道"]
BGB_01989A=["香港仔魚類批發市場，香港仔海傍道"]
BGB_01990A=["香港仔漁業及海事分署，香港仔海傍道","田灣街"]
BGB_01991A=["華富邨華樂樓，華富道"]
BGB_01992A=["華富商場，華富道"]
BGB_01993A=["華富邨華清樓，華富道"]
BGB_01994A=["培英中學，華富道"]
BGB_01995A=["華富 (北)"]
BGB_01996A=["余掁強紀念第二中學，薄扶林道","置富花園"]
BGB_01997A=["置富徑，置富道"]
BGB_01998A=["置富花園1-7座，置富道"]
BGB_01999A=["置富南區廣場，置富道"]
BGB_02000A=["置富花園網球場，置富道"]
BGB_02001A=["薄扶林村，薄扶林道","職業訓練局薄扶林大樓、牛奶公司高級職員宿舍"]
BGB_02002A=["薄扶林水塘道，薄扶林道"]
BGB_02003A=["嘉林閣，薄扶林道"]
BGB_02004A=["心光學校，薄扶林道"]
BGB_02005A=["瑪麗醫院，薄扶林道"]
BGB_02006A=["香港華人基督教聯會薄扶林道墳場，薄扶林道","啟明寺"]
BGB_02007A=["摩星嶺道，薄扶林道"]
BGB_02008A=["香港大學蒲飛路校園，薄扶林道","富林苑"]
BGB_02009A=["蒲飛路，薄扶林道","學士臺"]
BGB_02010A=["何東夫人堂，薄扶林道","寶翠園"]
BGB_02011A=["香港大學百周年校園，薄扶林道","香港大學站"]
BGB_02012A=["聖士提反堂中學，薄扶林道"]
BGB_02013A=["第二街"]
BGB_02014A=["西區警署，德輔道西","瑧璈"]
BGB_02015A=["正街，德輔道西","瑧蓺"]
BGB_02016A=["東邊街，德輔道西","西營盤站"]
BGB_02017A=["修打蘭街，德輔道西"]
BGB_02018A=["海港政府大樓，統一碼頭道"]
BGB_02019A=["國際金融中心商場，民祥街","香港站"]
BGB_02020A=["郵政總局，康樂廣場","怡和大廈、交易廣場、中環站"]
BGB_02021A=["大會堂，干諾道中"]
BGB_02022A=["中環 (交易廣場)","香港站"]
BGB_02022B=["中環 (交易廣場)"]
BGB_02023A=["恒生銀行總行大廈，干諾道中"]
BGB_02024A=["中環中心，皇后大道中"]
BGB_02025A=["荷李活華庭，皇后大道中"]
BGB_02026A=["上環市政大廈，皇后大道中"]
BGB_02027A=["帝后華庭，皇后大道西","荷李活道"]
BGB_02028A=["修打蘭街，皇后大道西"]
BGB_02029A=["正街，皇后大道西"]
BGB_02030A=["西邊街，皇后大道西"]
BGB_02031A=["李陞小學，薄扶林道"]
BGB_02032A=["香港大學西閘，薄扶林道","香港大學站"]
BGB_02033A=["何東夫人堂，薄扶林道","寶翠園"]
BGB_02034A=["蒲飛路，薄扶林道","學士臺"]
BGB_02035A=["薄扶林道遊樂場，薄扶林道"]
BGB_02036A=["香港華人基督教聯會薄扶林道墳場，薄扶林道","啟明寺"]
BGB_02037A=["瑪麗醫院，薄扶林道"]
BGB_02038A=["心光學校，薄扶林道"]
BGB_02039A=["明德村，薄扶林道"]
BGB_02040A=["薄扶林水塘道，薄扶林道","香港大學西高山學生及職員宿舍、伯大尼修院"]
BGB_02041A=["薄扶林村，薄扶林道","職業訓練局薄扶林大樓"]
BGB_02042A=["富明苑，置富道"]
BGB_02043A=["富仁苑，置富道"]
BGB_02044A=["雅緻洋房，置富道"]
BGB_02045A=["薄扶林消防局，域多利道","政府化驗所食物安全檢測所"]
BGB_02046A=["華富邨華生樓，華富道"]
BGB_02047A=["華富邨華泰樓，華富道"]
BGB_02048A=["華富 (南)"]
BGB_02049A=["華富邨華安樓，華富道"]
BGB_02050A=["興和街，石排灣道","漁映樓、田灣站"]
BGB_02051A=["聖伯多祿堂，香港仔大道","香港仔中心"]
BGB_02052A=["漁暉道，香港仔大道","香港仔站"]
BGB_02053A=["業漁大廈，香港仔大道"]
BGB_02054A=["甄沾記大廈，黃竹坑道"]
BGB_02055A=["港島南岸，南朗山道","南朗山道熟食市場、黃竹坑站"]
BGB_02056A=["陳白沙紀念中學，警校道"]
BGB_02057A=["香港大球場，東院道"]
BGB_02058A=["加路運山道","南華體育會"]
BGB_02059A=["怡和街","崇光百貨、銅鑼灣站"]
BGB_02060A=["堅拿道東，軒尼詩道","時代廣場"]
BGB_02061A=["廣生行大廈，軒尼詩道"]
BGB_02062A=["西港城，干諾道西","港澳碼頭"]
BGB_02063A=["皇后街，德輔道西"]
BGB_02064A=["高陞街，德輔道西"]
BGB_02065A=["正街，德輔道西","瑧蓺"]
BGB_02066A=["水街，德輔道西","瑧璈"]
BGB_02067A=["山道，德輔道西"]
BGB_02068A=["堅尼地城游泳池，堅彌地城海旁","寶翠園"]
BGB_02069A=["山市街，堅尼地城海旁"]
BGB_02070A=["聯邦新樓，卑路乍街","堅尼地城站"]
BGB_02071A=["加惠民道，域多利道"]
BGB_02072A=["西寧閣，域多利道"]
BGB_02073A=["港島西廢物轉運站，域多利道","西環鐘聲泳棚"]
BGB_02074A=["明愛賽馬會宿舍，域多利道","慈星閣仁愛服務中心"]
BGB_02075A=["摩星嶺徑，域多利道","芝加哥大學香港校園"]
BGB_02076A=["摩星嶺"]
BGB_02077A=["摩星嶺徑，域多利道","芝加哥大學香港校園"]
BGB_02078A=["明愛賽馬會宿舍，域多利道","慈星閣仁愛服務中心"]
BGB_02079A=["港島西廢物轉運站，域多利道","西環鐘聲泳棚"]
BGB_02080A=["西寧街，域多利道"]
BGB_02081A=["西市街，域多利道"]
BGB_02082A=["高逸華軒，吉席街"]
BGB_02083A=["卑路乍灣公園，堅彌地城海旁"]
BGB_02084A=["堅尼地城游泳池，堅彌地城海旁","歌連臣街"]
BGB_02085A=["堅尼地城游泳池休憩處，德輔道西"]
BGB_02086A=["均益大廈第一期，德輔道西","山道"]
BGB_02087A=["嘉安街，德輔道西"]
BGB_02088A=["永安中心，德輔道中","上環站"]
BGB_02089A=["盧押道，軒尼詩道","修頓球場"]
BGB_02090A=["杜老誌道，軒尼詩道","北海中心"]
BGB_02091A=["聖保祿醫院，銅鑼灣道"]
BGB_02092A=["紀律部隊人員體育及康樂會，東院道","聖光堂"]
BGB_02093A=["東華東院，東院道"]
BGB_02094A=["金鐘花園，金鐘道","金鐘廊、太古廣場、金鐘站"]
BGB_02095A=["太古廣場三座，皇后大道東"]
BGB_02096A=["聯發街，皇后大道東"]
BGB_02097A=["廈門街，皇后大道東","合和中心"]
BGB_02098A=["尚翹峰，皇后大道東","灣仔街市"]
BGB_02099A=["聖若瑟小學，皇后大道東","鄧肇堅醫院"]
BGB_02100A=["肇輝臺，司徒拔道"]
BGB_02101A=["司徒拔道休憩處，司徒拔道"]
BGB_02102A=["東山臺，司徒拔道"]
BGB_02103A=["聚豪居，淺水灣道"]
BGB_02104A=["南山別墅，淺水灣道"]
BGB_02105A=["曼克頓大廈，淺水灣道"]
BGB_02106A=["怡峰，淺水灣道","香島道站"]
BGB_02107A=["麗景園，淺水灣道","麗景道"]
BGB_02108A=["淺水灣海灘，淺水灣道","影灣園"]
BGB_02109A=["保華大廈，淺水灣道"]
BGB_02110A=["濱景園，淺水灣道"]
BGB_02111A=["赫蘭道，淺水灣道"]
BGB_02112A=["舂磡角道，赤柱峽道"]
BGB_02113A=["衛奕信徑第1段，赤柱峽道"]
BGB_02114A=["赤柱峽道"]
BGB_02115A=["赤柱崗抽水站，赤柱峽道"]
BGB_02116A=["赤柱峽道交匯處，赤柱峽道"]
BGB_02117A=["旭逸居，赤柱村道"]
BGB_02118A=["海灣園，赤柱村道"]
BGB_02119A=["赤柱廣場"]
BGB_02120A=["赤柱村，赤柱村道","赤柱市場、赤柱新街、赤柱站"]
BGB_02121A=["香港航海學校，東頭灣道"]
BGB_02122A=["聖士提反書院，東頭灣道","香港懲教博物館"]
BGB_02123A=["赤柱監獄"]
BGB_02124A=["聖士提反書院，東頭灣道"]
BGB_02125A=["赤柱村"]
BGB_02126A=["日出康城"]
BGB_02127A=["維港．灣畔，承豐道","澐澋"]
BGB_02128A=["上水匯，龍琛路","上水廣場、上水站"]
BGB_02129A=["寶熙苑，保安道","李鄭屋邨"]


# ---- ROUTES DETAILS ----

#路線方向
routes = {
    "1": {
        "方向": {
            "MAF 上環 (港澳碼頭)": {
                "1-正常路線": {
                    "停站": [
                        BGB_01839A, 
                        BGB_01840A,
                        BGB_01841A,
                        BGB_01842A,
                        BGB_01843A,
                        BGB_01844A,
                        BGB_01845A,
                        BGB_01846A,
                        BGB_01847A,
                        BGB_01848A,
                        BGB_01849A,
                        BGB_01850A,
                        BGB_01850A,
                        BGB_01851A,
                        BGB_01852A,
                        BGB_01853A,
                        BGB_01854A,
                        BGB_01855A,
                        BGB_01856A
                    ],
                    "收費": [
                        BGB_01839A+"起: $9.00"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/1-brr-maf_1229516"
                },
                "2-跑馬日，不停馬場": {
                    "停站": [
                        BGB_01839A, 
                        BGB_01840A,
                        BGB_01841A,
                        BGB_01842A,
                        BGB_01843A,
                        BGB_01844A,
                        BGB_01846A,
                        BGB_01847A,
                        BGB_01848A,
                        BGB_01849A,
                        BGB_01850A,
                        BGB_01850A,
                        BGB_01851A,
                        BGB_01852A,
                        BGB_01853A,
                        BGB_01854A,
                        BGB_01855A,
                        BGB_01856A
                    ],
                    "收費": [
                        BGB_01839A+"起: $9.00"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/1-brr-maf-race_1229517"
                }
            },
            "BRR 跑馬地 (蟠龍道)": {
                "1-正常路線": {
                    "停站": [
                        BGB_01856A,
                        BGB_01857A,
                        BGB_01858A,
                        BGB_01859A,
                        BGB_01860A,
                        BGB_01863A,
                        BGB_01864A,
                        BGB_01865A,
                        BGB_01866A,
                        BGB_01867A,
                        BGB_01868A,
                        BGB_01869A,
                        BGB_01870A,
                        BGB_01871A,
                        BGB_01872A,
                        BGB_01873A,
                        BGB_01874A,
                        BGB_01839A
                    ],
                    "收費": [
                        BGB_01856A+"起: $9.00"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/1-maf-brr_1229519"
                },
                "2-假日班次，改經德輔道中": {
                    "停站": [
                        BGB_01856A,
                        BGB_01857A,
                        BGB_01858A,
                        BGB_01859A,
                        BGB_01861A,
                        BGB_01862A,
                        BGB_01863A,
                        BGB_01864A,
                        BGB_01865A,
                        BGB_01866A,
                        BGB_01867A,
                        BGB_01868A,
                        BGB_01869A,
                        BGB_01870A,
                        BGB_01871A,
                        BGB_01872A,
                        BGB_01873A,
                        BGB_01874A,
                        BGB_01839A
                    ],
                    "收費": [
                        BGB_01856A+"起: $9.00"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/1-maf-brr-holidays_1229520"
                }
            }
}},
    "1M": {
        "方向": {
            "WNG 黃泥涌峽 (循環線)": {
                "1-正常路線": {
                    "停站": [
                        BGB_01856A,
                        BGB_01857A,
                        BGB_01858A,
                        BGB_01859A,
                        BGB_01860A,
                        BGB_01875A,
                        BGB_01876A,
                        BGB_01877A,
                        BGB_01878A,
                        BGB_01879A,
                        BGB_01866A,
                        BGB_01867A,
                        BGB_01868A,
                        BGB_01880A,
                        BGB_01869A,
                        BGB_01870A,
                        BGB_01871A,
                        BGB_01872A,
                        BGB_01873A,
                        BGB_01881A,
                        BGB_01882A,
                        BGB_01883A,
                        BGB_01884A,
                        BGB_01885A,
                        BGB_01886A,
                        BGB_01887A,
                        BGB_01888A,
                        BGB_01889A,
                        BGB_01890A,
                        BGB_01891A,
                        BGB_01840A,
                        BGB_01841A,
                        BGB_01842A,
                        BGB_01843A,
                        BGB_01844A,
                        BGB_01845A,
                        BGB_01846A,
                        BGB_01847A,
                        BGB_01848A,
                        BGB_01879A,
                        BGB_01892B,
                        BGB_01893A,
                        BGB_01894A,
                        BGB_01895A,
                        BGB_01856A
                    ],
                    "收費": [
                        BGB_01856A+"起: $10.60"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/1m-maf-wng-normal_1229550"
                } ,
                "2-跑馬日，不停馬場": {
                    "停站": [
                        BGB_01856A,
                        BGB_01857A,
                        BGB_01858A,
                        BGB_01859A,
                        BGB_01860A,
                        BGB_01875A,
                        BGB_01876A,
                        BGB_01877A,
                        BGB_01878A,
                        BGB_01879A,
                        BGB_01866A,
                        BGB_01867A,
                        BGB_01868A,
                        BGB_01880A,
                        BGB_01869A,
                        BGB_01870A,
                        BGB_01871A,
                        BGB_01872A,
                        BGB_01873A,
                        BGB_01881A,
                        BGB_01882A,
                        BGB_01883A,
                        BGB_01884A,
                        BGB_01885A,
                        BGB_01886A,
                        BGB_01887A,
                        BGB_01888A,
                        BGB_01889A,
                        BGB_01890A,
                        BGB_01891A,
                        BGB_01840A,
                        BGB_01841A,
                        BGB_01842A,
                        BGB_01843A,
                        BGB_01844A,
                        BGB_01846A,
                        BGB_01847A,
                        BGB_01848A,
                        BGB_01879A,
                        BGB_01892B,
                        BGB_01893A,
                        BGB_01894A,
                        BGB_01895A,
                        BGB_01856A
                    ],
                    "收費": [
                        BGB_01856A+"起: $10.60"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/1m-maf-wng-race_1229554"
                } ,
                "3-假日走線，改經德輔道中": {
                    "停站": [
                        BGB_01856A,
                        BGB_01857A,
                        BGB_01858A,
                        BGB_01859A,
                        BGB_01861A,
                        BGB_01862A,
                        BGB_01875A,
                        BGB_01876A,
                        BGB_01877A,
                        BGB_01878A,
                        BGB_01879A,
                        BGB_01866A,
                        BGB_01867A,
                        BGB_01868A,
                        BGB_01880A,
                        BGB_01869A,
                        BGB_01870A,
                        BGB_01871A,
                        BGB_01872A,
                        BGB_01873A,
                        BGB_01881A,
                        BGB_01882A,
                        BGB_01883A,
                        BGB_01884A,
                        BGB_01885A,
                        BGB_01886A,
                        BGB_01887A,
                        BGB_01888A,
                        BGB_01889A,
                        BGB_01890A,
                        BGB_01891A,
                        BGB_01840A,
                        BGB_01841A,
                        BGB_01842A,
                        BGB_01843A,
                        BGB_01844A,
                        BGB_01845A,
                        BGB_01846A,
                        BGB_01847A,
                        BGB_01848A,
                        BGB_01879A,
                        BGB_01892B,
                        BGB_01893A,
                        BGB_01894A,
                        BGB_01895A,
                        BGB_01856A
                    ],
                    "收費": [
                        BGB_01856A+"起: $10.60"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/1m-maf-wng-normal_1229550"
                }
            }
}},
"N1": {
        "方向": {
            "MAF 上環 (港澳碼頭)": {
                "1-正常路線": {
                    "停站": [
                        "跑馬地 (蟠龍道) ($18.00)", "箕鏈坊，藍塘道", "桂芳街，成和道", "山村道，成和道", "景光街",
                        "養和醫院，黃泥涌道", "跑馬地馬場，黃泥涌道", "厚德里，黃泥涌道", "禮頓道，摩利臣山道", 
                        "勿地臣街，禮頓街", "雲翠大廈，禮頓道", "邊靈頓街", "希慎廣場，軒尼詩道", "天樂里，軒尼詩道",
                        "北海中心，軒尼詩道", "軒尼詩道官立小學，軒尼詩道", "修頓球場，軒尼詩道", "晏頓街，軒尼詩道", "太古廣場，金鐘道",
                        "中銀大廈，金鐘道", "置地廣場，德輔道中", "中環街市，德輔道中", "急庇利街，德輔道中",
                        "上環 (港澳碼頭)"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/n1-brr-maf_1243452"
                }
            },
            "BRR 跑馬地 (蟠龍道)": {
                "1-正常路線": {
                    "停站": [
                        "上環 (港澳碼頭) ($18.00)", "無限極廣場，德輔道中", "恒生銀行總行大廈，德輔道中", "德忌利士街，德輔道中", 
                        "皇后像廣場 ，遮打道", "金鐘廊，金鐘道", "軍器廠街，軒尼詩道", "柯布連道，軒尼詩道", 
                        "史釗域道，軒尼詩道", "馬師道，軒尼詩道", "崇光百貨，軒尼詩道", "糖街，怡和街", "加路連山道，禮頓道",
                        "逸廬，黃泥涌道", "禮頓中心，禮頓道", "紀利華木球會，黃泥涌道",
                        "雅谷大廈，黃泥涌道", "跑馬地（下），黃泥涌道", "奕蔭街，成和道", "昇平樓，成和道", 
                        "箕鏈坊", "跑馬地 (蟠龍道)"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/n1-maf-brr_1243449"
                }
            }
}},
"2A": {
        "方向": {
            "ADE 金鐘東": {
                "1-正常路線": {
                    "停站": [
                        "嘉亨灣 ($9.90)", "愛秩序灣海濱公園，愛勤道", "愛蝶灣，愛賢街", "峻峰花園，東喜道", "筲箕灣",
                        "海灣華庭，筲箕灣道", "新成街，筲箕灣道", "筲箕灣廣場，耀興道", "東盛苑，耀興道", "耀東邨耀明樓，耀興道",
                        "耀東商場，耀興道", "耀東邨", "耀東邨耀華樓，耀興道", "東熹苑景熹閣，耀興道", "興東邨，耀興道", "太寧街，惠亨街",
                        "康怡廣場，康山道", "寶峰苑，英皇道", "柏架山道，英皇道", "太古坊，英皇道", "民新街，英皇道", "模範邨，英皇道",
                        "健康村，英皇道", "港運城，英皇道", "新都城大廈，英皇道", "長康街，英皇道", "炮台山站，英皇道", "清風街，英皇道",
                        "香港中央圖書館，高士威道", "希慎廣場，軒尼詩道", "北海中心，軒尼詩道", "軒尼詩道官立小學，軒尼詩道", 
                        "香港會議展覽中心 (舊翼)，菲林明道", "中信大廈，龍匯道", "中環軍營，龍和道", "金鐘廊，德立街"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/2a-grp-ade_1243442"
                },
                "2-繁忙時間短途車，只往銅鑼灣": {
                    "停站": [
                        "嘉亨灣 ($9.90)", "愛秩序灣海濱公園，愛勤道", "愛蝶灣，愛賢街", "峻峰花園，東喜道", "筲箕灣",
                        "海灣華庭，筲箕灣道", "新成街，筲箕灣道", "筲箕灣廣場，耀興道", "東盛苑，耀興道", "耀東邨耀明樓，耀興道",
                        "耀東商場，耀興道", "耀東邨", "耀東邨耀華樓，耀興道", "東熹苑景熹閣，耀興道", "興東邨，耀興道", "太寧街，惠亨街",
                        "康怡廣場，康山道", "寶峰苑，英皇道", "柏架山道，英皇道", "太古坊，英皇道", "民新街，英皇道", "模範邨，英皇道",
                        "健康村，英皇道", "港運城，英皇道", "新都城大廈，英皇道", "長康街，英皇道", "炮台山站，英皇道", "清風街，英皇道",
                        "香港中央圖書館，高士威道", "希慎廣場，軒尼詩道"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/2a-grp-hec-peak_1244084"
                }
            },
            "GRP 嘉亨灣": {
                "1-正常路線": {
                    "停站": [
                        "金鐘 (東) ($9.90)", "政府總部，夏愨道", "中信大廈，龍匯道", "中環廣場，港灣道", "史釗域道，軒尼詩道",
                        "馬師道，軒尼詩道", "崇光百貨，軒尼詩道", "維多利亞公園，高士威道", "銀幕街，英皇道", "七海商業中心，英皇道",
                        "電廠街，英皇道", "糖水道，英皇道", "琴行街，英皇道", "港運城，英皇道", "健康村，英皇道",
                        "模範邨，英皇道", "北角官立小學，英皇道", "新威園，英皇道", "惠安苑，英皇道", "康怡廣場，康山道",
                        "太康樓，太康街 ($7.00)", "鯉景灣，鯉景道", "西灣河站，太安街", "東欣苑，耀興道", "東熹苑耀興道，耀興道",
                        "東熹苑逸熹閣，耀興道", "耀東邨耀華樓，耀興道", "耀東邨", "耀東邨耀興道，耀興道", "耀東邨耀貴樓",
                        "筲箕灣廣場，耀興道", "南安里，筲箕灣道", "筲箕灣", "愛東邨，愛賢街", "東旭苑，愛勤道", "嘉亨灣"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/2a-ade-grp_1243500"
                },
                "2-繁忙時間短途車，由灣仔開出": {
                    "停站": [
                        "馬師道，軒尼詩道", "崇光百貨，軒尼詩道", "維多利亞公園，高士威道", "銀幕街，英皇道", "七海商業中心，英皇道",
                        "電廠街，英皇道", "糖水道，英皇道", "琴行街，英皇道", "港運城，英皇道", "健康村，英皇道",
                        "模範邨，英皇道", "北角官立小學，英皇道", "新威園，英皇道", "惠安苑，英皇道", "康怡廣場，康山道",
                        "太康樓，太康街 ($7.00)", "鯉景灣，鯉景道", "西灣河站，太安街", "東欣苑，耀興道", "東熹苑耀興道，耀興道",
                        "東熹苑逸熹閣，耀興道", "耀東邨耀華樓，耀興道", "耀東邨"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/2a-crb-yit-peak_1244080"
                }
            }
}},
"2X": {
        "方向": {
            "EXC 灣仔 (會展站)": {
                "1-正常路線": {
                    "停站": [
                        "嘉亨灣 ($11.50)", "愛秩序灣海濱公園，愛勤道", "愛蝶灣，愛賢街", "峻峰花園，東喜道", "筲箕灣",
                        "海灣華庭，筲箕灣道", "新成街，筲箕灣道", "海晏街，筲箕灣道", "西灣河文娛中心，筲箕灣道", "太康樓，太康街",
                        "清風街，英皇道 ($7.70)", "香港中央圖書館，高士威道", "希慎廣場，軒尼詩道", "北海中心，軒尼詩道", 
                        "軒尼詩道官立小學，軒尼詩道", "會展站"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/2x-grp-exc_1299296"
                },
                "2-繁忙時間短途車，只往銅鑼灣": {
                    "停站": [
                        "嘉亨灣 ($9.90)", "愛秩序灣海濱公園，愛勤道", "愛蝶灣，愛賢街", "峻峰花園，東喜道", "筲箕灣",
                        "海灣華庭，筲箕灣道", "新成街，筲箕灣道", "筲箕灣廣場，耀興道", "東盛苑，耀興道", "耀東邨耀明樓，耀興道",
                        "燿東商場，耀興道", "耀東邨", "耀東邨耀華樓，耀興道", "東熹苑景熹閣，耀興道", "興東邨，耀興道", "太寧街，惠亨街",
                        "康怡廣場，康山道", "寶峰苑，英皇道", "柏架山道，英皇道", "太古坊，英皇道", "民新街，英皇道", "模範邨，英皇道",
                        "健康村，英皇道", "港運城，英皇道", "新都城大廈，英皇道", "長康街，英皇道", "炮台山站，英皇道", "清風街，英皇道",
                        "香港中央圖書館，高士威道", "希慎廣場，軒尼詩道"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/2a-grp-hec-peak_1244084"
                }
            },
            "GRP 嘉亨灣": {
                "1-正常路線": {
                    "停站": [
                        "金鐘 (東) ($9.90)", "政府總部，夏愨道", "中信大廈，龍匯道", "中環廣場，港灣道", "史釗域道，軒尼詩道",
                        "馬師道，軒尼詩道", "崇光百貨，軒尼詩道", "維多利亞公園，高士威道", "銀幕街，英皇道", "七海商業中心，英皇道",
                        "電廠街，英皇道", "糖水道，英皇道", "琴行街，英皇道", "港運城，英皇道", "健康村，英皇道",
                        "模範邨，英皇道", "北角官立小學，英皇道", "新威園，英皇道", "惠安苑，英皇道", "康怡廣場，康山道",
                        "太康樓，太康街 ($7.00)", "鯉景灣，鯉景道", "西灣河站，太安街", "東欣苑，耀興道", "東熹苑耀興道，耀興道",
                        "東熹苑逸熹閣，耀興道", "耀東邨耀華樓，耀興道", "耀東邨", "耀東邨耀興道，耀興道", "耀東邨耀貴樓",
                        "筲箕灣廣場，耀興道", "南安里，筲箕灣道", "筲箕灣", "愛東邨，愛賢街", "東旭苑，愛勤道", "嘉亨灣"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/2a-ade-grp_1243500"
                },
                "2-繁忙時間短途車，由銅鑼灣開出": {
                    "停站": [
                        "馬師道，軒尼詩道", "崇光百貨，軒尼詩道", "維多利亞公園，高士威道", "銀幕街，英皇道", "七海商業中心，英皇道",
                        "電廠街，英皇道", "糖水道，英皇道", "琴行街，英皇道", "港運城，英皇道", "健康村，英皇道",
                        "模範邨，英皇道", "北角官立小學，英皇道", "新威園，英皇道", "惠安苑，英皇道", "康怡廣場，康山道",
                        "太康樓，太康街 ($7.00)", "鯉景灣，鯉景道", "西灣河站，太安街", "東欣苑，耀興道", "東熹苑耀興道，耀興道",
                        "東熹苑逸熹閣，耀興道", "耀東邨耀華樓，耀興道", "耀東邨"
                    ],
                    "地圖": "https://umap.openstreetmap.fr/en/map/2a-crb-yit-peak_1244080"
                }
            }
}}
}

# ------------------- Streamlit UI 設定 -------------------
st.set_page_config(page_title="漢堡巴士路線資料", page_icon="🚌", layout="wide")

st.markdown(
    """
    <style>
    @import url('https://fonts.googleapis.com/css2?family=Roboto:wght@400;500&display=swap');
    @import url('https://fonts.googleapis.com/css2?family=Source+Han+Sans+TC:wght@400;500&display=swap');
    html, body, [class*="css"]  {
        font-family: 'Source Han Sans TC', 'Roboto', sans-serif;

    }
    </style>
    """,
    unsafe_allow_html=True
)

st.title("🚌 漢堡巴士路線")
st.subheader("查閱各路線資料")
st.markdown("[🔗 漢堡巴士 Spreadsheet](https://docs.google.com/spreadsheets/d/1_hF_4ObI7j7OKKa__Bs9-fCLS6jYLvtTxg_nzhzkLjU/edit?gid=956048970)")

# ------------------- 分欄 Layout：左右界面 -------------------
left_col, right_col = st.columns([3, 5])

with left_col:
    input_route = st.text_input("輸入路線", "")
    input_route = input_route.upper().strip()

    if input_route and input_route in routes:
        directions = routes[input_route]["方向"]
        selected_direction = st.selectbox("選擇方向", list(directions.keys()))

        variants = directions[selected_direction]
        selected_variant = st.selectbox("選擇走線", list(variants.keys()))

        variant_data = variants[selected_variant]

    elif input_route:
        st.warning("未有此路線")
        variant_data = None  # 🔐 防止後面繼續執行錯誤
    
    if "variant_data" in locals() and variant_data:
        layer_id = variant_data["地圖"]

        st.markdown("地圖")

        # 建立地圖 iframe URL
        map_url = variant_data["地圖"]

        st.components.v1.html(f"""
            <iframe src="{map_url}"
                width="100%" height="500" frameborder="1"
                allowfullscreen allow="geolocation">
            </iframe>
            """, height=520)

with right_col:

    if "variant_data" in locals() and variant_data and "停站" in variant_data:
        st.markdown("🚏 停站")
        for i, stop in enumerate(variant_data["停站"], start=1):
            st.write(f"{i}. {stop}")